orderapp/target/generated/wsdl/OrderProcess.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions name="OrderProcessService" targetNamespace="http://order.demo/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://order.demo/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
  <wsdl:types>
<xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns="http://order.demo/" attributeFormDefault="unqualified" elementFormDefault="unqualified" targetNamespace="http://order.demo/">
    <xs:complexType name="order">
        <xs:sequence>
            <xs:element minOccurs="0" name="customerID" type="xs:string"/>
            <xs:element minOccurs="0" name="itemID" type="xs:string"/>
            <xs:element name="price" type="xs:double"/>
            <xs:element name="qty" type="xs:int"/>
        </xs:sequence>
    </xs:complexType>
    <xs:element name="processOrder" type="processOrder"/>
    <xs:complexType name="processOrder">
        <xs:sequence>
            <xs:element minOccurs="0" name="arg0" type="order"/>
        </xs:sequence>
    </xs:complexType>
    <xs:element name="processOrderResponse" type="processOrderResponse"/>
    <xs:complexType name="processOrderResponse">
        <xs:sequence>
            <xs:element minOccurs="0" name="return" type="xs:string"/>
        </xs:sequence>
    </xs:complexType>
</xs:schema>
  </wsdl:types>
  <wsdl:message name="processOrderResponse">
    <wsdl:part name="parameters" element="tns:processOrderResponse">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="processOrder">
    <wsdl:part name="parameters" element="tns:processOrder">
    </wsdl:part>
  </wsdl:message>
  <wsdl:portType name="OrderProcess">
    <wsdl:operation name="processOrder">
      <wsdl:input name="processOrder" message="tns:processOrder">
    </wsdl:input>
      <wsdl:output name="processOrderResponse" message="tns:processOrderResponse">
    </wsdl:output>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="OrderProcessServiceSoapBinding" type="tns:OrderProcess">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="processOrder">
      <soap:operation soapAction="" style="document"/>
      <wsdl:input name="processOrder">
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="processOrderResponse">
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="OrderProcessService">
    <wsdl:port name="OrderProcessPort" binding="tns:OrderProcessServiceSoapBinding">
      <soap:address location="http://localhost:9090/hello"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
