CXF_ProviderService/test.xml

<!-- <?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Header />
	<SOAP-ENV:Body>
		<processOrder xmlns="http://order.demo/">
			<return>ORD1234</return>
		</processOrder>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Header />
	<SOAP-ENV:Body>
		<processOrder xmlns="http://order.demo/">
			<arg0>
				<customerID>Naveen</customerID>
				<itemID>I001</itemID>
				<price>2001.00</price>
				<qty>200</qty>
			</arg0>
		</processOrder>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Header />
	<SOAP-ENV:Body>
		<processOrder xmlns="http://order.demo/">
			<arg0>
				<customerID>Naveen</customerID>
				<itemID>I001</itemID>
				<price>2001.00</price>
				<qty>200</qty>
			</arg0>
		</processOrder>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Header />
	<SOAP-ENV:Body>
		<processOrder xmlns="http://order.demo/">
			<return>ORD1234</return>
		</processOrder>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>

 -->